/* 設定データ
---------------------------------------*/
var commandList =  {
    talk:    { name: 'はなす' },
    check:   { name: 'しらべる' },
    item:    { name: 'もちもの' }
};


var itemsData = {
    ill_goku_1:      { name: '孫悟空のイラスト1', content: 'ui/data/ill_goku_1' },
    ill_goku_2:      { name: '孫悟空のイラスト2', content: 'ui/data/ill_goku_2' },
    ill_local_1:     { name: '地域イラスト1', content: 'ui/data/ill_local_1' },
    ill_local_2:     { name: '地域イラスト2', content: 'ui/data/ill_local_2' },
    ill_local_3:     { name: '地域イラスト3', content: 'ui/data/ill_local_3' },
    ill_car_1:       { name: '車のイラスト1', content: 'ui/data/ill_car_1' },
    ill_car_2:       { name: '車のイラスト2', content: 'ui/data/ill_car_2' },
    ill_airport_1:   { name: '空港のイラスト1', content: 'ui/data/ill_airport_1' },
    ill_airport_2:   { name: '空港のイラスト2', content: 'ui/data/ill_airport_2' },
    ill_char_bus:    { name: 'バスのキャラクター', content: 'ui/data/ill_char_bus' },
    ill_char_wolfman:{ name: '狼男のキャラクター', content: 'ui/data/ill_char_wolfman' },
    ill_artist:      { name: 'ロックアーティストのイラスト', content: 'ui/data/ill_artist' },
    doc_axonometric: { name: '立体感のある家の作成法', content: 'ui/data/doc_axonometric' },
    portfolio:       { name: 'ポートフォリオ', content: 'ui/data/portfolio' }
 };


var fieldObjectsData = [
    {
        name: 'たからばこ',
        message: [
            ['たからばこをそっとあけてみた。', '_'],
            ['なにもない。']],
        x: 23,
        y: 3,
        w: 32,
        h: 48,
        frameBlock: 0,
        item: 'ill_local_1'
    },{
        name: 'たからばこ',
        message: [
            ['こんなとこにもたからばこが。だれが置いたの。', '_'],
            ['もう...ない。']],
        x: 29,
        y: 14,
        w: 32,
        h: 48,
        frameBlock: 0,
        item: 'ill_char_wolfman'
    },{
        name: 'ツボ',
        message: [
            ['ツボをのなかをのぞいた。'],
            ['もうツボの中はほこりだけみたい。']],
        x: 22,
        y: 3,
        w: 32,
        h: 48,
        frameBlock: 1,
        item: ''
    },{
        name: 'ツボ',
        message: [
            ['ツボをのなかをのぞいた。'],
            ['ツボの中はほこりだけみたいだ。']],
        x: 24,
        y: 3,
        w: 32,
        h: 48,
        frameBlock: 1,
        item: ''
    },{
        name: 'ツボ',
        message: [
            ['ツボをのなかをのぞいた。'],
            ['ツボの中はほこりだけみたいだ。']],
        x: 12,
        y: 9,
        w: 32,
        h: 48,
        frameBlock: 1,
        item: ''
    },{
        name: 'ツボ',
        message: [
            ['ツボをのなかをのぞいた。'],
            ['ツボの中はほこりだけみたいだ。']],
        x: 19,
        y: 12,
        w: 32,
        h: 48,
        frameBlock: 1,
        item: ''
    },{
        name: '木製のちっちゃい箱',
        message: [
            ['なかにはなにもない…', 'と、思ったらなんかある！', '_'],
            ['もうちょっと注意深くならなくては(心の声)']],
        x: 6,
        y: 4,
        w: 32,
        h: 48,
        frameBlock: 2,
        item: 'ill_goku_2'
    },{
        name: '木製っぽいちっちゃい箱',
        message: [
            ['木製っぽいちっちゃい箱をヨコからのぞいてみた。', '_', 'トーンがはがれかけてる。'],
            ['ちっちゃい箱は音をたててくずれた。弁償、かも。']],
        x: 6,
        y: 9,
        w: 32,
        h: 48,
        frameBlock: 2,
        item: 'ill_car_2'
    },{
        name: '本棚',
        message: [
            ['本棚'],
            ['']],
        x: 25,
        y: 10,
        w: 32,
        h: 48,
        frameBlock: 3,
        item: ''
    },{
        name: '本棚',
        message: [
            ['本棚をちらりのぞいた。', '_'],
            ['']],
        x: 26,
        y: 10,
        w: 32,
        h: 48,
        frameBlock: 3,
        item: 'doc_axonometric'
    },{
        name: '本棚',
        message: [
            ['本棚をちらりのぞいた。'],
            ['『亜愛一郎の狼狽』大好きな本だ。']],
        x: 27,
        y: 10,
        w: 32,
        h: 48,
        frameBlock: 3,
        item: ''
    },{
        name: 'ひきだし1',
        message: [
            ['_'],
            ['モワレが…']],
        x: 8,
        y: 3,
        w: 32,
        h: 48,
        frameBlock: 4,
        item: 'ill_artist'
    },{
        name: 'ひきだし2',
        message: [
            ['ひきだしをあけてみた。防虫剤のニオイはわりと好きだ。'],
            ['めぼしいものはなにもない。']],
        x: 10,
        y: 10,
        w: 32,
        h: 48,
        frameBlock: 4,
        item: ''
    },{
        name: 'たてふだ1',
        message: [
            ['ようこそ、ポートフォリオの村へ！'],
            ['サイト本編とは異なる、おまけ制作物などをごらんください。']],
        x: 3,
        y: 5,
        w: 32,
        h: 48,
        frameBlock: 5,
        item: ''
    },{
        name: 'たてふだ2',
        message: [
            ['右側の茶色い建物は、じつは図書館のつもりです。'],
            ['どうぞ、おはいりください。']],
        x: 22,
        y: 9,
        w: 32,
        h: 48,
        frameBlock: 5,
        item: ''
    },{
        name: 'たてふだ3',
        message: [
            ['ん？たてふだの後ろになにかが貼ってある。', '_'],
            ['はがしたセロハンテープあとが残っている。']],
        x: 29,
        y: 5,
        w: 32,
        h: 48,
        frameBlock: 5,
        item: 'ill_airport_2'
    }
];


var villagersData = [
    {
        name: '村人1',
        message: [
            ['わたしが運転するのはもっぱら軽自動車のアイです。でも、はい、コレ。', '_'],
            ['ではでは。ドライブに行ってきます。']],
        x: 9,
        y: 3,
        w: 32,
        h: 48,
        frameBlock: 1,
        item: 'ill_car_1'
    },
    {
        name: '村人2',
        message: [
            ['こないだこれ落としてったよ。', '_'],
            ['もう、財布とかいえのカギとかなくさないようにね！']],
        x: 25,
        y: 11,
        w: 32,
        h: 48,
        frameBlock: 2,
        item: 'ill_char_bus'
    },
    {
        name: '村人3',
        message: [
            ['わたしは番人です。'],
            ['あなたはこれを持っていきますか？']],
        x: 24,
        y: 4,
        w: 32,
        h: 48,
        frameBlock: 3,
        item: ''
    },
    {
        name: '村人4',
        message: [
            ['_', 'ものごころついてから飛行機とか乗ったことないし。'],
            ['行きたいとこは…ある。']],
        x: 8,
        y: 10,
        w: 32,
        h: 48,
        frameBlock: 1,
        item: 'ill_airport_1'
    },
    {
        name: '村人5',
        message: [
            ['行ったことないけど沖縄ッていいとこなんだろーなー。', '_'],
            ['ハワイもいいな。']],
        x: 20,
        y: 14,
        w: 32,
        h: 48,
        frameBlock: 2,
        item: 'ill_local_3'
    },
    {
        name: '村人6',
        message: [
            ['こんにちは。'],
            ['いろんなものを調べたり話してものをもらったら、『もちもの』からみられるよ。']],
        x: 6,
        y: 7,
        w: 32,
        h: 48,
        frameBlock: 3,
        item: ''
    },
    {
        name: '村人7',
        message: [
            ['左のくつからベタがはみだしちゃった。', '_'],
            ['なおしといてください。']],
        x: 20,
        y: 1,
        w: 32,
        h: 48,
        frameBlock: 3,
        item: 'ill_goku_1'
    },
    {
        name: '村人8',
        message: [
            ['きみよりずっとうまくかけるようになったから、これは返すよ。', '_', 'つぎは何のドンブリをかこうか。'],
            ['…かつ丼、中華丼…あ、きみももっとがんばりたまえ。']],
        x: 10,
        y: 13,
        w: 32,
        h: 48,
        frameBlock: 3,
        item: 'ill_local_2'
    }
];


var backgroundMapData_0 = [[
    [1,1,1,1,32,34,1,1,28,1,1,1,1,1,1,1,99,101,1,1,1,28,28,28,28,28,1,1,1,1],
    [1,1,1,1,32,34,28,28,1,1,1,1,28,28,1,1,99,101,1,1,1,1,1,1,1,28,28,1,1,1],
    [1,1,1,1,32,34,1,161,161,161,161,161,1,1,28,1,99,101,1,28,1,161,161,161,161,161,1,1,1,1],
    [1,1,1,1,32,34,1,161,161,161,161,161,1,28,28,1,99,101,1,28,28,161,161,161,161,161,28,1,1,1],
    [1,1,1,28,32,34,1,161,161,161,161,161,28,1,83,84,100,100,84,85,1,161,161,161,161,161,28,28,1,1],
    [1,1,28,1,32,34,1,161,161,161,161,161,1,1,99,16,17,17,18,101,1,161,161,161,161,161,28,28,28,1],
    [84,84,84,84,96,96,84,84,84,84,84,84,84,84,100,32,96,96,34,100,84,84,84,84,84,84,84,84,84,84],
    [116,116,116,116,97,97,116,116,116,116,116,116,116,116,100,32,97,97,34,100,116,116,116,100,116,116,116,116,116,116],
    [28,1,1,28,32,34,1,161,161,161,161,161,1,1,99,48,49,49,50,101,1,1,28,100,28,28,28,1,28,1],
    [1,1,28,1,32,34,1,161,161,161,161,161,1,1,115,116,100,100,116,117,1,1,1,100,98,98,98,98,98,28],
    [1,28,1,28,32,34,1,161,161,161,161,161,1,1,28,1,99,101,1,1,1,1,28,100,98,98,98,98,98,1],
    [1,1,1,1,32,34,1,1,1,1,1,1,1,1,1,28,99,101,161,161,161,161,28,100,98,98,98,98,98,1],
    [1,1,1,1,32,34,28,28,28,1,28,1,1,0,1,28,99,101,161,161,161,161,28,100,98,98,98,98,98,1],
    [1,28,1,1,32,34,1,1,1,28,1,1,1,1,1,28,99,101,161,161,161,161,28,100,98,98,98,98,98,1],
    [28,1,28,1,32,34,1,1,28,1,28,1,1,1,1,28,99,101,161,161,161,161,28,100,98,98,98,98,98,1]
],[
    [94,-1,-1,-1,-1,-1,107,107,-1,-1,-1,-1,-1,-1,-1,107,-1,-1,107,-1,-1,-1,-1,-1,-1,-1,94,94,60,61],
    [-1,-1,-1,94,-1,-1,-1,-1,-1,94,-1,-1,-1,-1,-1,107,-1,-1,107,-1,-1,-1,-1,-1,-1,-1,-1,94,76,77],
    [-1,-1,94,-1,-1,-1,-1,7,23,23,23,7,-1,-1,-1,107,-1,-1,107,-1,-1,7,23,23,23,7,-1,-1,60,61],
    [-1,-1,-1,-1,-1,-1,-1,7,-1,-1,42,7,-1,-1,-1,107,-1,-1,107,-1,-1,7,-1,-1,-1,7,-1,-1,76,77],
    [60,61,-1,-1,-1,-1,-1,7,-1,-1,41,7,-1,107,-1,-1,-1,-1,-1,-1,107,7,-1,-1,-1,7,-1,-1,-1,-1],
    [76,77,-1,-1,-1,-1,107,23,23,-1,23,23,107,107,-1,-1,60,61,-1,-1,107,23,23,-1,23,23,-1,-1,-1,-1],
    [-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,76,77,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1],
    [-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1],
    [-1,-1,-1,-1,-1,-1,107,7,23,-1,23,7,107,107,-1,-1,-1,-1,-1,-1,107,107,-1,-1,-1,-1,-1,-1,-1,-1],
    [-1,-1,-1,-1,-1,-1,-1,7,-1,-1,-1,7,-1,107,-1,-1,-1,-1,-1,-1,107,-1,-1,-1,8,24,24,24,8,-1],
    [-1,-1,-1,-1,-1,-1,-1,7,42,41,42,7,-1,-1,-1,107,-1,-1,107,107,107,-1,-1,-1,24,-1,-1,-1,8,-1],
    [-1,-1,94,-1,-1,-1,-1,23,23,23,23,23,7,23,7,-1,-1,-1,7,23,23,7,-1,-1,-1,-1,-1,-1,8,-1],
    [-1,94,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,7,-1,7,-1,-1,-1,23,-1,42,7,-1,-1,-1,42,41,42,8,-1],
    [-1,-1,-1,-1,-1,-1,60,61,94,41,42,-1,23,23,23,-1,-1,-1,-1,-1,41,7,-1,-1,8,-1,-1,-1,8,-1],
    [-1,-1,-1,94,-1,-1,76,77,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,23,-1,42,7,-1,-1,24,24,24,24,24,-1]
]];

var backgroundMapCollisionData_0 = [
    [1,0,0,0,1,1,1,1,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,1,1,1,1],
    [0,0,0,1,1,1,0,0,0,1,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,1,1,1],
    [0,0,1,0,1,1,0,1,1,1,1,1,0,0,0,1,0,0,1,0,0,1,1,1,1,1,0,0,1,1],
    [0,0,0,0,1,1,0,1,0,0,0,1,0,0,0,1,0,0,1,0,0,1,0,0,0,1,0,0,1,1],
    [1,1,0,0,1,1,0,1,0,0,1,1,0,1,0,0,0,0,0,0,1,1,0,0,0,1,0,0,0,0],
    [1,1,0,0,1,1,1,1,1,0,1,1,1,1,0,1,1,1,1,0,1,1,1,0,1,1,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,1,1,1,1,1,0,1,1,1,1,0,1,1,1,1,0,1,1,0,0,0,0,0,0,0,0],
    [0,0,0,0,1,1,0,1,0,0,0,1,0,1,0,0,0,0,0,0,1,0,0,0,1,1,1,1,1,0],
    [0,0,0,0,1,1,0,1,0,1,0,1,0,0,0,1,0,0,1,1,1,0,0,0,1,0,0,0,1,0],
    [0,0,1,0,1,1,0,1,1,1,1,1,1,1,1,0,0,0,1,1,1,1,0,0,0,0,0,0,1,0],
    [0,1,0,0,1,1,0,0,0,0,0,0,1,0,1,0,0,0,1,0,0,1,0,0,0,0,1,0,1,0],
    [0,0,0,0,1,1,1,1,1,1,0,0,1,1,1,0,0,0,0,0,1,1,0,0,1,0,0,0,1,0],
    [0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,1,1,1,1,1,0]
];